# ClearFinishMaterials Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCProductWrapper..::..ClearFinishMaterials Method
IFCProductWrapper Class See Also
---
Clear finish materials in this wrapper.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ClearFinishMaterials()
```

Visual Basic
---
```text
Public Sub ClearFinishMaterials
```

Visual C++
---
```text
public:
void ClearFinishMaterials()
```

# See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace